In [1]:
import sys
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import mysql.connector
from functools import reduce

### LECTURA DATOS

In [2]:
mysql_config = {
    'host': 'localhost',
    'user': 'root',
    'password': 'contraseña',
    'database': 'cancer_mama'
}

conn_mysql = mysql.connector.connect(**mysql_config)
cursor_mysql = conn_mysql.cursor()

query = "SELECT * FROM tumor;"
df_sql = pd.read_sql_query(query, conn_mysql)

C:\Users\34699\AppData\Local\Temp\ipykernel_2884\2706193724.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_sql = pd.read_sql_query(query, conn_mysql)

In [3]:
df_csv1 = pd.read_csv('./Datos/patients_batch1.csv')
df_csv2 = pd.read_csv('./Datos/patients_batch2.csv')
df_excel = pd.read_excel('./Datos/gynecological.xlsx')
df_json = pd.read_json('./Datos/histochemistry.json')

In [5]:
df_csv2

           ehr  birth_date diagnosis_date  death_date
0     72992494  13/02/1942     08/05/2018         NaN
1     73002338  22/10/1949     08/09/2018         NaN
2     73008149  04/12/1969     12/04/2018         NaN
3     73012939  18/09/1973     17/04/2014  01/01/2018
4     73019870  07/12/1955     24/05/2018         NaN
...        ...         ...            ...         ...
2995  99966287  16/12/1978     02/08/2018         NaN
2996  99981192  10/04/1949     28/10/2017         NaN
2997  99988958  21/01/1966     27/05/2013         NaN
2998  99992350  04/09/1939     17/12/2018         NaN
2999  99994417  10/02/1962     01/04/2017         NaN

[3000 rows x 4 columns]

### PREPROCESADO

Para el preprocesado vamos a comenzar uniendo los dataframes de origen csv, ya que comparten las mismas columnas. Pasaremos las fechas al tipo 'DD/MM/YY' y a continuación haremos el merge.

In [48]:
# dataframes = [df_json,df_csv2,df_csv1,df_sql,df_excel]
# df_final = reduce(lambda left, right: pd.merge(left, right, on='ehr', how='outer'), dataframes)
# df_final

In [60]:
df_csv = pd.merge(df_csv1, df_csv2, on='ehr', how='outer')
df_csv

,ehr,birth_date_x,diagnosis_date_x,death_date_x,birth_date_y,diagnosis_date_y,death_date_y
0,10011773,1959-07-05,2015-04-02,NaN,NaN,NaN,NaN
1,10020495,1953-10-02,2017-12-04,NaN,NaN,NaN,NaN
2,10030299,1966-08-16,2019-06-27,NaN,NaN,NaN,NaN
3,10030824,1953-03-03,2018-09-07,NaN,NaN,NaN,NaN
4,10041592,1959-07-06,2018-11-19,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
9995,99966287,NaN,NaN,NaN,16/12/1978,02/08/2018,NaN
9996,99981192,NaN,NaN,NaN,10/04/1949,28/10/2017,NaN
9997,99988958,NaN,NaN,NaN,21/01/1966,27/05/2013,NaN
9998,99992350,NaN,NaN,NaN,04/09/1939,17/12/2018,NaN
9999,99994417,NaN,NaN,NaN,10/02/1962,01/04/2017,NaN

nerea arregla tu mac